Repository: vzh/xringd-doc-ru
Catalog: xringd.8.*.po
Languages: ru

source: NAME
ru: НАЗВАНИЕ

source: xringd - The Linux extended modem ring server
ru: xringd - расширенный сервер модемных звонков для Linux

source: SYNOPSIS
ru: КРАТКИЙ ОБЗОР

source: B<xringd> [ I<options> ] [ I<modem_device_file> ]
ru: B<xringd> [ I<ключи> ] [ I<файл_устройства_модема> ]

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The xringd Linux extended Ring server will listen on a modem device for specific ring-delay patterns (sequences). Each sequence, when fully recognised, will execute a command you have chosen (subject to usual unix permissions). Delays are in fact delay ranges. Sequences and commands are read from a a configuration file. I<xringd> does not disturb your other modem programs, not even your getty. It coexists with them. I<xringd> probes (asynchronously) for the actual RING signal on the serial line.
ru: xringd − расширенный сервер звонков для Linux − слушает устройство модема для поиска специфических шаблонов (последовательностей) звонков-задержек. Для каждой полностью распознанной последовательности выполняет заданную вами команду (при условии наличия обычных прав доступа Unix). Задержки на самом деле задаются в виде диапазонов задержек. Последовательности и команды читаются из файла настроек. Программа I<xringd> не мешает ни другим программам для модема, ни даже getty. Она сосуществует с ними. I<xringd> (асинхронно) контролирует состояние сигнала RING последовательного порта.

source: OPTIONS
ru: КЛЮЧИ

source: B<-a >I< command_on_each_ring>
ru: B<-a >I< команда_для_каждого_звонка>

source: Run this command on every ring. Use perhaps to replace your boring phone ring.
ru: Запускать для каждого звонка указанную команду. Может использоваться для замены наскучившего вам телефонного звонка.

source: B<-c >I< config_file>
ru: B<-c >I< файл_настроек>

source: Use an alternate configuration file. The default is B</etc/xringd.conf>
ru: Использовать альтернативный файл настроек. По умолчанию используется B</etc/xringd.conf>.

source: Run in debug mode (no daemon - logging = 100). I<xringd> does not run as a daemon and produces log messages on standard error.
ru: Запустить в режиме отладки (без запуска службы, журналирование = 100). I<xringd> не запускается как служба и выдаёт журнальные сообщения на стандартный вывод ошибок.

source: See a mini usage info
ru: Показать мини-справку по использованию

source: B<-i msecs-ignored>
ru: B<-i миллисекунды_игнорируемой_паузы>

source: If consecutive rings have a time (in msec) distance less than this one, they are taken as one. For countries where a ring creates two sounds and modems that subsequently cause two changes on the serial RI line. Use this option to make two near RIs look as one to xringd. A value of 100-800 will most likely be the most appropriate.
ru: Если выдержка времени между двумя звонками подряд меньше указанной (в миллисекундах), они считаются одним звонком. Предназначено для стран, где звонок создаёт два звука, и для модемов, которые вызывают два изменения последовательной линии RI подряд. Этот ключ используется для того, чтобы для xringd два подряд сигнала RI выглядели как один. Наиболее подходящим будет, скорее всего, значение от 100 до 800.

source: B<-l loglevel>
ru: B<-l уровень_журналирования>

source: Logging level. Default=1. Use 10+ for more info. When running as daemon you can use -l 10 or 100 to get debug messages via syslog(LOG_DEBUG, ...). 0 means NO logging at all.
ru: Уровень журналирования. По умолчанию 1. Используйте 10+ для получения более подробной информации. При запуске в качестве службы можно использовать -l 10 или 100 для получения отладочных сообщений через syslog (LOG_DEBUG, ...). Значение 0 означает НЕ использовать журналирование вообще.

source: B<-m >I< modem_device_file>
ru: B<-m >I< файл_устройства_модема>

source: The modem device file (can also be given as the final argument).
ru: Файл устройства модема (может также задаваться последним аргументом команды).

source: Disables ECHO on modem device upon opening. This will avoid echo races reported with some modems.
ru: Запрет ECHO для устройства модема при его открытии. Это предотвратит «гонки» ECHO, о которых сообщалось для некоторых модемов.

source: Performs only a syntax check of its configuration file. It implies -d. Try this first when you write a new configuration file. I<xringd> does not become a daemon and produces log messages on standard error.
ru: Синтаксическая проверка файла настроек программы. Подразумевает установку ключа -d. После записи нового файла настроек сначала попробуйте запуск с этим ключом. I<xringd> не будет работать как служба и выдаст журнальные сообщения на стандартный вывод ошибок.

source: B<-t >I< init_time>
ru: B<-t >I< время_инициализации>

source: After a reset (or the first time it is run), the time (in seconds) to wait until rings are accepted. Default: 15
ru: Время ожидания (в секундах) после сброса (или при первом запуске) до приёма звонков. По умолчанию: 15.

source: CONFIGURATION FILE
ru: ФАЙЛ НАСТРОЕК

source: The configuration file consists of lines of the following format:
ru: Файл настроек состоит из строк в следующем формате:

source: B<R secs[-secs] [ R secs[-secs] ] ... : command>
ru: B<R секунды[-секунды] [ R секунды[-секунды] ] ... : команда>

source: Each line is related to a sequence(pattern) that can be potentially matched. The I<command> at the end gets executed if the sequence was fully matched. A full match is found if the delays between the rings are within the delay ranges given in the configuration line of a sequence. A full match will also reset the state machine. It will start accepting new rings as when run the first time. I<R> means ring and it should B<always> be the first symbol in a sequence.
ru: В каждой строке описывается последовательность (шаблон), с которым потенциально могут совпасть звонки. Указанная в конце I<команда> выполняется, если последовательность звонков полностью совпадает с шаблоном. Считается, что полное совпадение найдено, если задержки между звонками находятся в пределах диапазонов, определённых в строке описания последовательности. Кроме того, нахождение полного совпадения приводит к сбросу конечного автомата. Программа начнёт принимать новые звонки так же, как при первоначальном запуске. Символ I<R> означает звонок, и последовательность B<всегда> должна начинаться с этого символа.

source: Comment lines start with a ``#'' symbol at the beginning of the line. Empty lines are ignored.
ru: Строки комментариев начинаются с символа ``#'' в начале строки. Пустые строки игнорируются.

source: Note that command lines options can also be included in the config file. A line should start with the '-' of an option. See example below. Options -c and -n are ignored in the config file. Options in the configuration file take precedence over the ones in the command line.
ru: Обратите внимание, что ключи командной строки могут также устанавливаться и в файле настроек. Строка для ключа должна начинаться с '-'. См. пример ниже. Ключи -c и -n в файле настроек игнорируются. Ключи, указанные в файле настроек, имеют преимущество над ключами, заданными в командной строке.

source: EXAMPLE CONFIGURATION
ru: ПРИМЕР ФАЙЛА НАСТРОЕК

source: # xringd configuration file -- sample # -a /usr/local/audio/bin/play /usr/local/lib/sounds/ring.au -l 100 # # 2 rings 10-16 sec apart followed by 30 secs silence R 10-16 R 30 : /etc/ppp/ppp.start office1 # 3 rings 10-20 sec apart followed by 20 secs silence R 10-20 R 10-20 R 20 : /etc/ppp/ppp.start office2 # 2 nearish rings then 1 ring after 20-26 secs, silence for 30 secs R 1-5 R 20-26 R 30 : /usr/local/bin/turn-heater on
ru: # Файл настроек xringd -- пример # -a /usr/local/audio/bin/play /usr/local/lib/sounds/ring.au -l 100 # # 2 звонка на 10-16 секунд друг от друга, за ними 30 секунд тишины R 10-16 R 30 : /etc/ppp/ppp.start office1 # 3 звонка по 10-20 секунд друг от друга, за ними 20 секунд тишины R 10-20 R 10-20 R 20 : /etc/ppp/ppp.start office2 # 2 звонка подряд, затем один через 20-26 секунд, тишина на 30 секунд R 1-5 R 20-26 R 30 : /usr/local/bin/turn-heater on

source: FILES
ru: ФАЙЛЫ

source: The default configuration file.
ru: Стандартный файл настроек.

source: The default modem device used.
ru: Устройство модема, используемое по умолчанию.

source: SIGNALS
ru: СИГНАЛЫ

source: The following signals have the specified effect when sent to the I<xringd> process.
ru: Посылка процессу I<xringd> следующих сигналов вызовет указанные ниже действия.

source: Clean exit the server.
ru: Чистый выход сервера.

source: "Simulates" a RING as if it came from the modem.
ru: «Симулирует» сигнал звонка RING, как будто бы он пришёл с модема.

source: Restart the internal machine ignoring any current state. Reread the config file. Close and reopen the modem device. If a syntax error is found in a line all the following lines are ignored. So when you restart, make sure you look at the log for any reported errors. A better way is to always "parse" your config file with "xringd -n" to check its syntax first.
ru: Производится перезапуск внутренней машины, невзирая на текущее состояние. Перечитывается файл настроек. Закрывается и заново открывается устройство модема. При нахождении в какой-либо строке ошибки синтаксиса все последующие строки игнорируются. Поэтому после перезапуска обязательно посмотрите журнал на предмет любых сообщений об ошибках. Но лучше всегда перед первым запуском производить «проверку синтаксиса» своего файла настройки с помощью «xringd -n».

source: NOTES
ru: ПРИМЕЧАНИЯ

source: At the moment, I<xringd> is device dependent on Linux kernel 1.3.48+ and serial devices that support the TIOCMIWAIT, TIOCGICOUNT ioctl(2) calls. These were added by the same author to the Linux kernel so that a process can wait on a modem DCD,RI,DSR,CTS change on a serial port and can also read a kernel count of the interrupts on each one of these 4 lines. RI was used for this program. (Other possibilities exist in using this ioctl for instrumentation projects.) Note that these ioctls are only implemented for 16xx0 uarts now (Jan96).
ru: В настоящее время I<xringd> представляет собой программу, зависимую от устройств в ядрах Linux версий 1.3.48+ и последовательных устройств, поддерживающих вызовы ioctl(2) TIOCMIWAIT, TIOCGICOUNT. Эти вызовы были добавлены в ядро Linux тем же автором, для того чтобы любой процесс мог следить за изменениями DCD, RI, DSR, CTS на последовательном порту, а также считывать число посчитанных ядром прерываний для каждой из этих 4 линий. Для данной программы использовался сигнал RI. (Другой возможностью использования этих ioctl может быть разработка измерительных приборов.) Учтите, что на данный момент (январь 96 года) эти ioctl реализованы только для устройств uart 16xx0.

source: You B<have> to use a proper serial cable for this to work. A cable with all pins properly connected to your modem (especially the RI line for this program!) and serial port will save you any trouble. Internal modems should normally work.
ru: Для того чтобы это работало, B<необходимо> использовать соответствующий последовательный кабель. Кабель, все выводы которого правильно подключены к модему (особенно линия RI для этой программы!) и к последовательному порту, сохранит ваши силы и нервы. Внутренние модемы обычно тоже должны работать.

source: If you activate a program which uses the modem after ringd it should normally B<flush> the input buffer. In many cases you will have a few "RING" strings in your serial tty buffer that will most likely confuse a dialup script (eg. chat).
ru: Если вы активизируете программу, которая использует модем после xringd, она обычно должна очистить (B<flush>) входной буфер. Чаще всего в буфере последовательной tty у вас будет несколько строк «RING», которые, скорее всего, не дадут правильно работать скрипту дозвона (например, chat).

source: The richness of the ring-delay pattern "language" is not great. However, you certainly have many possibilities. Beware of overlaps though, and always have something that will "unlock" any current sequence (eq. 4 consecutive rings that safely exit from any current state).
ru: «Язык» шаблонов звонков-задержек не очень богат. Однако, у вас определённо немало возможностей. Берегитесь, правда, совпадений в шаблонах, и всегда имейте что-нибудь для «разблокировки» любой текущей последовательности (например, 4 последовательных звонка для безопасного выхода из любого текущего состояния).

source: If someone calls in while you are on the delay phase of your "pattern" then you are obviously out of luck.
ru: Если кто-то позвонит в тот момент, когда ваш «шаблон» в фазе задержки, то вам, очевидно, не повезло.

source: Only tone dialing phones allow quick dial that can meet short timing restrictions possibly imposed by your configuration file. Make sure you use the redial button on the calling phone if there is one - you will be able to "dial" in about a second. Pulse dialers may introduce unexpected delays. If they are your only choice, use longer delays and wider delay ranges.
ru: Удовлетворить ограничениям на короткие временные интервалы, накладываемые, возможно, вашим файлом настроек, могут только телефоны с тоновым набором, которые позволяют позвонить быстро. Для звонка используйте на телефоне кнопку повторного дозвона (redial), если таковая имеется, и у вас будет возможность «позвонить» примерно за секунду. Импульсные телефоны могут вводить неожиданные задержки. Если у вас нет другого выбора, используйте более длинные задержки и более широкие диапазоны задержек.

source: It was reported by a user that the "rings" you hear on the calling handset do not directly correspond to the ones actually heard on the receiving end. In the tests done with xringd in a few countries, the number of rings remained the same on calling and called set. Just leave each one of the rings you hear on the calling end to "settle" (do not break them before they finish). A delay between a ring heard on the caller set and the equivalent one on the called one was noticed but causes no problem for xringd. Feel free to send me your comments on this.
ru: Один пользователь сообщил, что «звонки», которые слышны в трубке звонящего телефона, не полностью соответствуют тем, что фактически слышатся на принимающей стороне. В тестах, проведённых с помощью I<xringd> в нескольких странах, количество звонков оставалось одинаковым на вызывающем и принимающем устройстве. Просто дайте каждому из звонков, которые вы слышите на принимающей стороне, «устаканиться» (не прерывайте их до того, пока они не закончатся). Задержка между звонком, который слышится на вызывающей стороне, и эквивалентным звонком на той, куда звонят, заметна, но не создаёт для xringd никаких проблем. Не стесняйтесь присылать мне любые комментарии на этот счёт.

source: Many getty-like programs may be configured to pick up the phone on the first ring. Obviously, this will make xringd minimally useful. Make your getty to reply after 2-4 rings so that you have many possibilities open for xringd.
ru: Многие программы, подобные getty, могут быть настроены на поднятие трубки по первому звонку. Очевидно, это делает программу xringd практически бесполезной. Настройте свою getty на ответ после 2-4 звонков, чтобы для xringd оставалось больше возможностей.

source: pppd (and probably some other programs) like to hold a tty in exclusive mode. Make sure you start xringd B<before> such programs, otherwise it won't be allowed to open the modem device. Also, when such a program closes it may leave the line hung up. You need to restart (kill -HUP) xringd in such a case. It does not make sense to run xringd on a line which is permanently used for PPP/SLIP - such a line never "rings"!
ru: pppd (и может быть какие-нибудь другие программы) любят держать tty в режиме монопольного доступа. Убедитесь, что программа xringd запускается B<до> таких программ, иначе ей не будет позволено открывать модемное устройство. Кроме того, когда такая программа закрывается, она может оставить линию висящей с поднятой трубкой. В таком случае xringd надо перезапустить (kill -HUP). Нет смысла запускать xringd на линии, которая постоянно используется для PPP/SLIP - такая линия никогда не «звонит»!

source: Spurious interrupts (and thus pseudo-RINGs) may occur during modem switch on/off; run xringd B<after> your modem is switched on.
ru: В процессе включения/отключения модема могут возникать ложные прерывания (и, таким образом, псевдо-сигналы RING); запускайте xringd B<после> включения модема.

source: It is highly recommended - for security reasons - to make the configuration file inaccessible (even for read) to anything but xringd. Treat it as a shadow-password-like file. It is very easy for anyone to call your number and activate a command, if they know a RING-delay sequence "password". So try not to disarm your home-alarm via it. You have been warned!
ru: Крайне рекомендуется - по причинам безопасности - сделать файл настройки недоступным (даже на чтение) для всех, кроме xringd. Рассматривайте его как файл, подобный файлу теневых паролей. Кто угодно может запросто позвонить на ваш номер и активизировать какую-нибудь команду, если знает «пароль» в виде последовательности звонков-задержек. Поэтому не подвергайте свою домашнюю аварийную сигнализацию испытанию быть обезоруженной таким способом. Мы вас предупредили!

source: AUTHOR
ru: АВТОР

source: Linux xringd by Angelo Haritsis <ah@doc.ic.ac.uk>
ru: Linux xringd Автор: Angelo Haritsis <ah@doc.ic.ac.uk>

source: GENERAL -------
ru: ОБЩЕЕ -----

source: How about having your home computer connect to your office or your provider, turn the air-conditioner on/off or activate _any_ command when you are not at home? Simple, you would say. Well, imagine now that your home modem does not have voice/DTMF-capabilities and you can use no modem to dialup your home. The only thing you ahve is a common telephone. Furthermore (even if you DO have a modem), you might wish your home computer to execute a choice of different commands _without_ its modem going off hook (consequently not paying for any connection).
ru: Как насчёт того, чтобы ваш компьютер подключился к вашему офису или провайдеру, включил-выключил кондиционер или запустил _любую_ команду, когда вас нет дома? Вы, может быть, скажете, что это просто. Хорошо, представим теперь, что в домашнем модеме нет поддержки voice/DTMF, и для дозвона домой нельзя использовать модем. У вас есть только обычный телефон. Далее (даже если у вас ЕСТЬ модем), вам может захотеться, чтобы домашний компьютер выполнял набор различных команд, не загружая свой модем (следовательно, без платы за какое бы то ни было соединение).

source: xringd, the Extended Ring Daemon can do it for you. And a bit more. It will monitor the serial line for RING signals and activate commands if specific "ring-delay sequences" are probed.
ru: xringd ― Extended Ring Daemon (расширенная служба телефонных звонков) ― может сделать это для вас. И более того. Она будет отслеживать сигналы RING на последовательной линии и запускать команды при появлении специфических «последовательностей звонков-задержек».

source: It will also allow you to execute a command per ring probed. This allows you to replace your boring phoneset rings with sounds from your sound card or even with messages displayed on screens on machine(s) on your network!
ru: Кроме того, она позволяет для каждого распознанного звонка выполнять какую-нибудь команду. Это даёт возможность заменить надоевшие звонки телефона звуками со своей звуковой карты или даже сообщениями, отображаемыми на экранах машин(ы) в сети!

source: How do you actually signal your linux machine to execute different commands? You just make it receive rings and delays between them that follow specific patterns (as defined in a configuration file). Different patterns activate different commands. For example: Produce a single ring, wait from 10-25 seonds, produce another single ring. If no rings appear after this for 30 seconds your linux pc starts up a connection with your office1!
ru: Как на самом деле сообщить Linux-машине о необходимости выполнения разных команд? Просто сделать так, чтобы она оценивала звонки и выдержки времени между ними на соответствие определённым шаблонам (заданным в файле настроек). Разные команды активизируются разными шаблонами. Например: выдать звонок, подождать 10-25 секунд, выдать ещё один звонок. Если после этого звонков в течение 30 секунд нет, ваш Linux-компьютер запустит соединение с вашим офисом office1!

source: You can build configuration files that can accept a wealth of ring-delay patterns and excute different commands upon recognition of each one.
ru: Можно написать такие файлы настроек, что программа будет использовать множество разных шаблонов звонков-задержек и выполнять при распознавании каждого из них различные команды.

source: xringd will NOT affect any programs using the serial line. It can even coexist with your getty. Just make sure that your getty does not pick up the phone too early so that it gives you some time to "play" with your ring "patterns". It uses 2 new ioctls found on official Linux kernels of version 1.3.48 and up (ioctl's implemented by the same author).
ru: Программа xringd НЕ помешает ни одной программе, использующей последовательную линию. Она может даже сосуществовать с getty. Только сделайте так, чтобы getty не поднимала трубку слишком рано, чтобы она дала вам некоторое время «поиграться» шаблонами «звонков». Она использует два новых ioctl из официальных ядер Linux версий 1.3.48 и выше (ioctl реализованы тем же автором).

source: The most inventive minds will probably make this work without even using a modem (I have no idea how easy it is to produce a circuit which will assert the RI line on a UART when the telephone rings - perhaps use the UART already taken by the mouse - RI is not used on it!). If you have a useful idea on this, let me know so that I can include it with this package. But probably one could use an old 300/1200/2400bps modem and do the same job on lower cost!
ru: Возможно, наиболее изобретательные умы решат эту задачу даже без использования модема (не имею понятия, насколько легко создать схему, которая выставит сигнал RI на UART, когда звонит телефон, ― может быть можно использовать UART, уже занятый мышью, ― в нём RI не используется!). Если у вас есть подходящие идеи на этот счёт, дайте мне знать, чтобы я мог включить их в этот пакет. Но, быть может, проще использовать старый модем на 300/1200/2400bps и решить ту же задачу меньшими силами!

source: Make sure you read carefully the manual page provided.
ru: Внимательно прочтите имеющуюся страницу руководства.

source: Please try this program and send me any comments or bug reports/patches via email.
ru: Пробуйте работать с этой программой и присылайте мне по электронной почте любые комментарии и отчёты об ошибках или заплаты для неё.

source: TO INSTALL ----------
ru: УСТАНОВКА ---------

source: Change default installation dirs in Makefile if you wish. Other defaults are mostly ok. Type: make install
ru: Если хотите, можете поменять в Makefile заданные по умолчанию каталоги установки. Другие стандартные настройки обычно изменений не требуют. Наберите: make install

source: You can run xringd as ANY user. The commands that it can execute are subject to the permision of the user running xringd. Usually you run it as root.
ru: Программу xringd можно запускать под ЛЮБЫМ пользователем. Команды, которые она может выполнять, определяются правами пользователя, запускающего xringd. Обычно xringd запускается с правами суперпользователя.
