Repository: vzh/xringd-doc-ru
Catalog: xringd.8.*.po
Languages: ru

source: For debugging you should uncomment this line from Makefile #DBG=-DRINGSM_DEBUG and recompile ringsm.c Then you should run xringd as: xringd -c config -d Remember when building the final version to build ringsm.c with no debugging!
ru: Для отладки в Makefile нужно раскомментировать следующую строку: #DBG=-DRINGSM_DEBUG и перекомпилировать ringsm.c. Затем xringd следует запустить следующим образом: xringd -c config -d Запомните, при сборке окончательной версии ringsm.c нужно собирать, отключив отладку!

source: HARDWARE --------
ru: АППАРАТНОЕ ОБЕСПЕЧЕНИЕ ----------------------

source: You will need a 16xx0x (most prevalent) uart (the needed kernel ioctls are currently implemented only for this family) and a fully connected modem cable if using an external modem (the RI line MUST be connected!). 16xx0x family includes: 8250 82450 16450 16450A 16c450 16550 16550A 16552 and compatible.
ru: Вам понадобится приёмопередатчик uart 16xx0x (наиболее распространённый) (нужные ioctl ядра в настоящее время реализованы только для этого семейства) и кабель модема с полным подключением, если используется внешний модем (сигнал RI ДОЛЖЕН быть подключен!). Семейство 16xx0x включает: 8250 82450 16450 16450A 16c450 16550 16550A 16552 и совместимые с ними.

source: KERNEL PATCH ------------
ru: ЗАПЛАТА ДЛЯ ЯДРА ----------------

source: NB: This patch is NOT NEEDED! xinrgd has been tested to work fine on many setups and all the "stock" kernels after 1.3.48. It is just suggested as a quick thing to try if you have problems with xringd reporting errors endlessly.
ru: Примечание: Эта заплата НЕ НУЖНА! Проверено, что xringd прекрасно работает в различных конфигурациях и со всеми ядрами «основной линейки» после 1.3.48. Эту заплату просто предлагается попробовать как быстрое решение при таких проблемах с xringd, когда служба бесконечно сообщает об ошибках.

source: This kernel patch will make xringd not receive an EIO (or other) error on ioctl. The EIO case is taken care of in xringd. However, this patch will prevent any errors from the ioctl. drivers/char/tty_io.c, function hung_up_tty_ioctl(). Add before: return -EIO; if (cmd == TIOCMIWAIT || cmd == TIOCGICOUNT) return tty_ioctl(inode, file, cmd, arg);
ru: С этой заплатой для ядра xringd не будет получать EIO (или другие) ошибки в ioctl. О случае с EIO в xringd уже позаботились. Но эта заплата предотвратит любые ошибки из ioctl. drivers/char/tty_io.c, function hung_up_tty_ioctl(). Добавьте перед: return -EIO; if (cmd == TIOCMIWAIT || cmd == TIOCGICOUNT) return tty_ioctl(inode, file, cmd, arg);

source: THANKS ------
ru: БЛАГОДАРНОСТИ -------------

source: For beta testing and useful comments, I must not forget to extend my thanks to the following people: Richard Huveneers <huveneer@math.ruu.nl> Gary Houston <ghouston@actrix.gen.nz> Mattheos Papavasiliou <mattheos@archinet.demon.co.uk> Andrea Arcangeli <arcangeli@mbox.queen.it>
ru: За бета-тестирование и полезные комментарии я должен не забыть выразить свою благодарность следующим людям: Richard Huveneers <huveneer@math.ruu.nl> Gary Houston <ghouston@actrix.gen.nz> Mattheos Papavasiliou <mattheos@archinet.demon.co.uk> Andrea Arcangeli <arcangeli@mbox.queen.it>

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ru: Эта программа является свободным ПО; её можно распространять и/или изменять под условиями Стандартной Общественной Лицензии GNU, опубликованной организацией Free Software Foundation, или версии 2 этой Лицензии, или (по выбору) любой более поздней версии.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ru: Эта программа распространяется в надежде, что она будет полезной, но БЕЗ КАКИХ БЫ ТО НИ БЫЛО ГАРАНТИЙ, даже без подразумеваемых гарантий на ПРИГОДНОСТЬ ДЛЯ КОММЕРЧЕСКИХ или ЛЮБЫХ КОНКРЕТНЫХ ЦЕЛЕЙ. Подробности см. в Стандартной Общественной Лицензии GNU.

source: You should have received a copy of the GNU General Public License along with this program; see the file COPYING. If not, write to the Free Software Foundation, 675 Mass Ave, Cambridge, MA 02139, USA.
ru: Вместе с этой программой вы должны были получить копию Стандартной Общественной Лицензии GNU; смотрите файл COPYING. В противном случае напишите по адресу: Free Software Foundation, 675 Mass Ave, Cambridge, MA 02139, USA.

source: xringd configuration file -- sample
ru: Файл настроек xringd -- пример

source: Line format:
ru: Формат строк:

source: R secs[-secs] [ R secs[-secs] ] ... : command
ru: R секунды[-секунды] [ R секунды[-секунды] ] ... : команда

source: comments start with '#' in column 1 only
ru: комментарии начинаются с символа '#' в первой позиции строки

source: Pay attention to avoid overlapping events; xringd will only do a
ru: Обратите внимание на предотвращение перекрывающихся событий; xringd делает

source: syntax (not a semantic) check on this file.
ru: только синтаксическую (не семантическую) проверку этого файла.

source: Allow a "safe-exit" ring sequence (eg 3 consecutive rings cancels it all)
ru: Предусмотрите возможность задать последовательность звонков для # «безопасного выхода» (например, 3 звонка подряд всё отменяют)

source: command line options (-c -n silently ignored)
ru: ключи командной строки (-c -n молча игнорируются)

source: modem device
ru: устройство модема

source: rings this far are taken as one ring:
ru: звонки отстоящие друг от друга на это время считаются одним звонком:

source: after resetting, time after we accept new sequences:
ru: время после сброса, через которое мы принимаем новые последовательности:

source: logging level:
ru: уровень журналирования:

source: 2 rings 10-25 sec apart followed by 30 secs silence: ppp connect with office1
ru: 2 звонка 10-25 секунд друг от друга, за ними 30 секунд тишины: ppp-соединение с office1

source: 3 rings with 10-20 secs between each pair => ppp connect with office2
ru: 3 звонка с промежутками 10-20 секунд между каждыми двумя => ppp-соединение с office2

source: 2 nearish rings then 1 ring after 20-26 secs, followed by no ring in
ru: 2 звонка подряд, затем один через 20-26 секунд, а за ним нет звонка в течение

source: 30 secs => heater on!
ru: 30 секунд => включить печку!

source: #R 1-6 R 10-16 R 8 : /usr/local/bin/turn-heater on
ru: #R 1-6 R 20-26 R 30 : /usr/local/bin/turn-heater on

source: Debian default, can we say?
ru: Стандартный дозвон в Debian, можно так сказать?
